<template>
  <div
    class="backdrop"
    @click.self="$emit('close-privacy-policy-modal')"
  >
    <div class="popup overflow-auto shadow-lg rounded-3">
      <div class="container-fluid">
        <div class="h2 text-center">
          <b>プライバシーポリシー</b>
        </div><hr>
      </div>
      <div class="popup-body lh-lg">
        運営者（以下、「当社」といいます。）は、本ウェブサイト上で提供するWebサービス「ボインボインルーレット」（以下、「本サービス」といいます。）における、ユーザーの個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。<hr>
        <div class="h4">
          <b>第1条（個人情報）</b>
        </div>
        「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ、及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。<hr>
        <div class="h4">
          <b>第2条（個人情報の収集方法）</b>
        </div>
        当社は、ユーザーが利用登録をする際に氏名、メールアドレスなどの個人情報をお尋ねすることがあります。<hr>
        <div class="h4">
          <b>第3条（個人情報を収集・利用する目的）</b>
        </div>
        当社が個人情報を収集・利用する目的は、以下のとおりです。<br>
        当社サービスの提供・運営のため<br>
        ユーザーからのお問い合わせに回答するため（本人確認を行うことを含む）<br>
        メンテナンス、重要なお知らせなど必要に応じたご連絡のため<br>
        利用規約に違反したユーザーや、不正・不当な目的でサービスを利用しようとするユーザーの特定をし、ご利用をお断りするため<br>
        ユーザーにご自身の登録情報の閲覧や変更、削除、ご利用状況の閲覧を行っていただくため<br>
        上記の利用目的に付随する目的<hr>
        <div class="h4">
          <b>第4条（個人情報の第三者提供）</b>
        </div>
        当社は、次に掲げる場合を除いて、あらかじめユーザーの同意を得ることなく、第三者に個人情報を提供することはありません。ただし、個人情報保護法その他の法令で認められる場合を除きます。<br>
        人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき<br>
        公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき<br>
        国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき<br>
        予め次の事項を告知あるいは公表し、かつ当社が個人情報保護委員会に届出をしたとき<br>
        利用目的に第三者への提供を含むこと<br>
        第三者に提供されるデータの項目<br>
        第三者への提供の手段または方法<br>
        本人の求めに応じて個人情報の第三者への提供を停止すること<br>
        本人の求めを受け付ける方法<br>
        前項の定めにかかわらず、次に掲げる場合には、当該情報の提供先は第三者に該当しないものとします。<br>
        当社が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合<br>
        合併その他の事由による事業の承継に伴って個人情報が提供される場合<br>
        個人情報を特定の者との間で共同して利用する場合であって、その旨並びに共同して利用される個人情報の項目、共同して利用する者の範囲、利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について、あらかじめ本人に通知し、または本人が容易に知り得る状態に置いた場合<hr>
        <div class="h4">
          <b>第5条（アクセス解析ツール）</b>
        </div>
        当サイトでは、Googleによるアクセス解析ツール「Googleアナリティクス」を使用しています。このGoogleアナリティクスはデータの収集のためにCookieを使用しています。このデータは匿名で収集されており、個人を特定するものではありません。<br>
        この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認ください。この規約に関しての詳細は <a
          href="https://marketingplatform.google.com/about/analytics/terms/jp/"
          target="_blank"
          rel="noopener noreferrer"
        >Googleアナリティクスサービス利用規約</a>、 <a
          href="https://policies.google.com/technologies/ads?hl=ja"
          target="_blank"
          rel="noopener noreferrer"
        >Googleポリシーと規約</a>をご覧ください。<hr>
        <div class="h4">
          <b>第6条（プライバシーポリシーの変更）</b>
        </div>
        本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、ユーザーに通知することなく、変更することができるものとします。<br>
        当社が別途定める場合を除いて、変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。<hr>
        <div class="h4">
          <b>第7条（お問い合わせ窓口）</b>
        </div>
        本ポリシーに関するお問い合わせは、 <a
          href="https://twitter.com/issei423"
          target="_blank"
          rel="noopener noreferrer"
        >Twitterアカウント</a>までお願いいたします。<br>
        <br>
        以上
      </div>
      <div class="text-center">
        <button
          type="button"
          class="btn btn-outline-danger"
          @click="$emit('close-privacy-policy-modal')"
        >
          閉じる
        </button>
      </div>
    </div>
  </div>
</template>

<style scoped>
.backdrop {
  position: fixed;
  top: 0;
  left: 0;
  z-index: 1050;
  width: 100vw;
  height: 100vh;
  background-color: rgba(0, 0, 0, 0.5);
}
.popup {
  position: fixed;
  inset: 0;
  background-color: azure;
  margin: 1rem;
  padding: 1rem;
}
.h4 {
  margin-bottom: 0.5rem;
}
</style>